app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @school = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dtrwe"], ["room_number", 0], ["created_at", "2020-07-20 05:24:18.973056"], ["updated_at", "2020-07-20 05:24:18.973056"]]
---
  def create
   @school =SchoolClass.create(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @school = SchoolClass.find(params[:id])